zephyrproject-rtos/hal_nxp/dts/nxp/mcx/MCXA276VLH-pinctrl.h
#define PWM0_A2_P3_10 A15X_MUX('3',10,5) /* PT3_10 */
#define FLEXIO0_D18_P3_10 A15X_MUX('3',10,6) /* PT3_10 */
#define LPUART5_TXD_P3_10 A15X_MUX('3',10,8) /* PT3_10 */
#define LCD_P38_P3_10 A15X_MUX('3',10,9) /* PT3_10 */
#define SmartDMA_PIO10_P3_10 A15X_MUX('3',10,10) /* PT3_10 */
#define P3_11 A15X_MUX('3',11,0) /* PT3_11 */
#define WUU0_IN24_P3_11 A15X_MUX('3',11,0) /* PT3_11 */
#define TRIG_IN6_P3_11 A15X_MUX('3',11,1) /* PT3_11 */
#define LPSPI1_PCS0_P3_11 A15X_MUX('3',11,2) /* PT3_11 */
#define LPUART1_CTS_B_P3_11 A15X_MUX('3',11,3) /* PT3_11 */
#define CT1_MAT1_P3_11 A15X_MUX('3',11,4) /* PT3_11 */
#define PWM0_B2_P3_11 A15X_MUX('3',11,5) /* PT3_11 */
#define FLEXIO0_D19_P3_11 A15X_MUX('3',11,6) /* PT3_11 */
#define LPUART5_RXD_P3_11 A15X_MUX('3',11,8) /* PT3_11 */
#define LCD_P39_P3_11 A15X_MUX('3',11,9) /* PT3_11 */
#define SmartDMA_PIO11_P3_11 A15X_MUX('3',11,10) /* PT3_11 */
#define P3_12 A15X_MUX('3',12,0) /* PT3_12 */
#define ADC3_A14_P3_12 A15X_MUX('3',12,0) /* PT3_12 */
#define LPUART2_RTS_B_P3_12 A15X_MUX('3',12,2) /* PT3_12 */
#define LPUART3_TXD_P3_12 A15X_MUX('3',12,3) /* PT3_12 */
#define CT1_MAT2_P3_12 A15X_MUX('3',12,4) /* PT3_12 */
#define PWM0_X0_P3_12 A15X_MUX('3',12,5) /* PT3_12 */
#define FLEXIO0_D20_P3_12 A15X_MUX('3',12,6) /* PT3_12 */
#define PWM1_A2_P3_12 A15X_MUX('3',12,7) /* PT3_12 */
#define LCD_P40_P3_12 A15X_MUX('3',12,9) /* PT3_12 */
#define SmartDMA_PIO12_P3_12 A15X_MUX('3',12,10) /* PT3_12 */
#define P3_13 A15X_MUX('3',13,0) /* PT3_13 */
#define ADC3_A15_P3_13 A15X_MUX('3',13,0) /* PT3_13 */
#define LPUART2_CTS_B_P3_13 A15X_MUX('3',13,2) /* PT3_13 */
#define LPUART3_RXD_P3_13 A15X_MUX('3',13,3) /* PT3_13 */
#define CT1_MAT3_P3_13 A15X_MUX('3',13,4) /* PT3_13 */
#define PWM0_X1_P3_13 A15X_MUX('3',13,5) /* PT3_13 */
#define FLEXIO0_D21_P3_13 A15X_MUX('3',13,6) /* PT3_13 */
#define PWM1_B2_P3_13 A15X_MUX('3',13,7) /* PT3_13 */
#define LCD_P41_P3_13 A15X_MUX('3',13,9) /* PT3_13 */
#define SmartDMA_PIO13_P3_13 A15X_MUX('3',13,10) /* PT3_13 */
#define ADC3_A16_P3_14 A15X_MUX('3',14,0) /* PT3_14 */
#define WUU0_IN25_P3_14 A15X_MUX('3',14,0) /* PT3_14 */
#define P3_14 A15X_MUX('3',14,0) /* PT3_14 */
#define LPUART2_RXD_P3_14 A15X_MUX('3',14,2) /* PT3_14 */
#define LPUART3_CTS_B_P3_14 A15X_MUX('3',14,3) /* PT3_14 */
#define CT_INP6_P3_14 A15X_MUX('3',14,4) /* PT3_14 */
#define PWM0_X2_P3_14 A15X_MUX('3',14,5) /* PT3_14 */
#define FLEXIO0_D22_P3_14 A15X_MUX('3',14,6) /* PT3_14 */
#define PWM1_A1_P3_14 A15X_MUX('3',14,7) /* PT3_14 */
#define LCD_P42_P3_14 A15X_MUX('3',14,9) /* PT3_14 */
#define SmartDMA_PIO14_P3_14 A15X_MUX('3',14,10) /* PT3_14 */
#define P3_15 A15X_MUX('3',15,0) /* PT3_15 */
#define ADC3_A17_P3_15 A15X_MUX('3',15,0) /* PT3_15 */
#define LPUART2_TXD_P3_15 A15X_MUX('3',15,2) /* PT3_15 */
#define LPUART3_RTS_B_P3_15 A15X_MUX('3',15,3) /* PT3_15 */
#define CT_INP7_P3_15 A15X_MUX('3',15,4) /* PT3_15 */
#define PWM0_X3_P3_15 A15X_MUX('3',15,5) /* PT3_15 */
#define FLEXIO0_D23_P3_15 A15X_MUX('3',15,6) /* PT3_15 */
#define PWM1_B1_P3_15 A15X_MUX('3',15,7) /* PT3_15 */
#define LCD_P43_P3_15 A15X_MUX('3',15,9) /* PT3_15 */
#define SmartDMA_PIO15_P3_15 A15X_MUX('3',15,10) /* PT3_15 */
#define WUU0_IN30_P3_27 A15X_MUX('3',27,0) /* PT3_27 */
#define P3_27 A15X_MUX('3',27,0) /* PT3_27 */
#define TRIG_OUT7_P3_27 A15X_MUX('3',27,1) /* PT3_27 */
#define LPI2C3_SCL_P3_27 A15X_MUX('3',27,2) /* PT3_27 */
#define LPUART4_TXD_P3_27 A15X_MUX('3',27,3) /* PT3_27 */
#define CT_INP13_P3_27 A15X_MUX('3',27,4) /* PT3_27 */
#define CT3_MAT1_P3_27 A15X_MUX('3',27,5) /* PT3_27 */
#define FLEXIO0_D27_P3_27 A15X_MUX('3',27,6) /* PT3_27 */
#define PWM1_A3_P3_27 A15X_MUX('3',27,7) /* PT3_27 */
#define SmartDMA_PIO27_P3_27 A15X_MUX('3',27,10) /* PT3_27 */
#define WUU0_IN26_P3_28 A15X_MUX('3',28,0) /* PT3_28 */
#define P3_28 A15X_MUX('3',28,0) /* PT3_28 */
#define TRIG_IN11_P3_28 A15X_MUX('3',28,1) /* PT3_28 */
#define LPI2C3_SDA_P3_28 A15X_MUX('3',28,2) /* PT3_28 */
#define LPUART4_RXD_P3_28 A15X_MUX('3',28,3) /* PT3_28 */
#define TRIG_IN11/CT_INP12_P3_28_P3_28 A15X_MUX('3',28,4) /* PT3_28 */
#define CT_INP12_P3_28 A15X_MUX('3',28,4) /* PT3_28 */
#define CT3_MAT2_P3_28 A15X_MUX('3',28,5) /* PT3_28 */
#define FLEXIO0_D28_P3_28 A15X_MUX('3',28,6) /* PT3_28 */
#define PWM1_B3_P3_28 A15X_MUX('3',28,7) /* PT3_28 */
#define SmartDMA_PIO28_P3_28 A15X_MUX('3',28,10) /* PT3_28 */
#define ADC1_A22_P3_29 A15X_MUX('3',29,0) /* PT3_29 */
#define WUU0_IN27_P3_29 A15X_MUX('3',29,0) /* PT3_29 */
#define P3_29 A15X_MUX('3',29,0) /* PT3_29 */
#define ISPMODE_N_P3_29 A15X_MUX('3',29,1) /* PT3_29 */
#define LPI2C3_HREQ_P3_29 A15X_MUX('3',29,2) /* PT3_29 */
#define CT_INP3_P3_29 A15X_MUX('3',29,4) /* PT3_29 */
#define CT3_MAT3_P3_29 A15X_MUX('3',29,5) /* PT3_29 */
#define FLEXIO0_D29_P3_29 A15X_MUX('3',29,6) /* PT3_29 */
#define SmartDMA_PIO29_P3_29 A15X_MUX('3',29,10) /* PT3_29 */
#define P3_30 A15X_MUX('3',30,0) /* PT3_30 */
#define ADC1_A21_P3_30 A15X_MUX('3',30,0) /* PT3_30 */
#define TRIG_OUT6_P3_30 A15X_MUX('3',30,1) /* PT3_30 */
#define LPI2C3_SCLS_P3_30 A15X_MUX('3',30,2) /* PT3_30 */
#define LPUART4_RTS_B_P3_30 A15X_MUX('3',30,3) /* PT3_30 */
#define CT0_MAT2_P3_30 A15X_MUX('3',30,4) /* PT3_30 */
#define FLEXIO0_D30_P3_30 A15X_MUX('3',30,6) /* PT3_30 */
#define PWM1_A0_P3_30 A15X_MUX('3',30,7) /* PT3_30 */
#define SmartDMA_PIO30_P3_30 A15X_MUX('3',30,10) /* PT3_30 */
#define P3_31 A15X_MUX('3',31,0) /* PT3_31 */
#define ADC1_A20_P3_31 A15X_MUX('3',31,0) /* PT3_31 */
#define LPTMR0_ALT2_P3_31 A15X_MUX('3',31,0) /* PT3_31 */
#define TRIG_IN10_P3_31 A15X_MUX('3',31,1) /* PT3_31 */
#define LPI2C3_SDAS_P3_31 A15X_MUX('3',31,2) /* PT3_31 */
#define LPUART4_CTS_B_P3_31 A15X_MUX('3',31,3) /* PT3_31 */
#define CT0_MAT3_P3_31 A15X_MUX('3',31,4) /* PT3_31 */
#define FLEXIO0_D31_P3_31 A15X_MUX('3',31,6) /* PT3_31 */
#define PWM1_B0_P3_31 A15X_MUX('3',31,7) /* PT3_31 */
#define SmartDMA_PIO31_P3_31 A15X_MUX('3',31,10) /* PT3_31 */
#endif
